In [40]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from getpass import getpass

In [41]:
password = getpass("SQL Password: ")

SQL Password: ········

In [42]:
dbName = "sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = create_engine(connectionData)

In [43]:
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

### Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

In [44]:
may = pd.read_sql_query('select * from sakila.rentals_may', engine)
may

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [45]:
june = pd.read_sql_query('select * from sakila.rentals_june', engine)
june

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

### Check the number of rentals for each customer for May

In [7]:
count_m = pd.read_sql_query(
'select customer_id,count(rental_id) as may_counts from rentals_may group by customer_id order by customer_id asc;'
,engine)
count_m

     customer_id  may_counts
0              1           2
1              2           1
2              3           2
3              5           3
4              6           3
..           ...         ...
515          594           4
516          595           1
517          596           6
518          597           2
519          599           1

[520 rows x 2 columns]

In [8]:
count_j = pd.read_sql_query(
'select customer_id,count(rental_id) as june_counts from rentals_june group by customer_id order by customer_id asc;'
,engine)
count_j

     customer_id  june_counts
0              1            7
1              2            1
2              3            4
3              4            6
4              5            5
..           ...          ...
585          595            2
586          596            2
587          597            3
588          598            1
589          599            4

[590 rows x 2 columns]

In [30]:
data = count_m.merge(count_j, on='customer_id',how='inner')
data

     customer_id  may_counts  june_counts
0              1           2            7
1              2           1            1
2              3           2            4
3              5           3            5
4              6           3            4
..           ...         ...          ...
507          594           4            6
508          595           1            2
509          596           6            2
510          597           2            3
511          599           1            4

[512 rows x 3 columns]

### Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [46]:
data['May-June Compersion'] = 'Compersion starts!!!'
data['May-June Compersion'][data['may_counts']>data['june_counts']] = 'Customer was more active in May'
data['May-June Compersion'][data['may_counts']<data['june_counts']] = 'Customer was more active in June'
data['May-June Compersion'][data['may_counts']==data['june_counts']] = 'Same amount of rentals!!'
data

     customer_id  may_counts  june_counts               May-June Compersion
0              1           2            7  Customer was more active in June
1              2           1            1          Same amount of rentals!!
2              3           2            4  Customer was more active in June
3              5           3            5  Customer was more active in June
4              6           3            4  Customer was more active in June
..           ...         ...          ...                               ...
507          594           4            6  Customer was more active in June
508          595           1            2  Customer was more active in June
509          596           6            2   Customer was more active in May
510          597           2            3  Customer was more active in June
511          599           1            4  Customer was more active in June

[512 rows x 4 columns]

In [58]:
def compersion(x):
    if x['may_counts'] > x['june_counts']:
        return "Customer was more active in May"
    if x['may_counts'] == x['june_counts']:
        return "Same amount of rentals!!"
    return "Customer was more active in June"

data['M/J_compersion_v2'] =data.apply(compersion, axis=1)

In [59]:
data.head(20)

,customer_id,may_counts,june_counts,May-June Compersion,M/J_compersion_v2
0,1,2,7,Customer was more active in June,Customer was more active in June
1,2,1,1,Same amount of rentals!!,Same amount of rentals!!
2,3,2,4,Customer was more active in June,Customer was more active in June
3,5,3,5,Customer was more active in June,Customer was more active in June
4,6,3,4,Customer was more active in June,Customer was more active in June
5,7,5,5,Same amount of rentals!!,Same amount of rentals!!
6,8,1,3,Customer was more active in June,Customer was more active in June
7,9,3,2,Customer was more active in May,Customer was more active in May
8,10,1,5,Customer was more active in June,Customer was more active in June
9,11,1,3,Customer was more active in June,Customer was more active in June
10,12,2,6,Customer was more active in June,Customer was more active in June
11,14,5,1,Customer was more active in May,Customer was more active in May
12,16,4,4,Same amount of rentals!!,Same amount of rentals!!
13,17,3,3,Same amount of rentals!!,Same amount of rentals!!
14,18,3,4,Customer was more active in June,Customer was more active in June
15,19,6,3,Customer was more active in May,Customer was more active in May
16,20,3,4,Customer was more active in June,Customer was more active in June
17,21,3,5,Customer was more active in June,Customer was more active in June
18,22,3,1,Customer was more active in May,Customer was more active in May
19,23,3,5,Customer was more active in June,Customer was more active in June